code-review/NRB_3471_3546/База_Стало/InformationRegisters/СтатусыПоручений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыПоручений</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусПоручения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПоручений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоИсполнения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КоличествоЦБ</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поручение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Стало/InformationRegisters/СтатусыПоручений/Ext/ManagerModule.bsl
// Создает движение по РС СтатусыПоручений.
//
// Параметры:
//  Движения			 - Движения - Движения документа
//  Поручение			 - ДокументСсылка.Поручение - Поручение
//  Дата				 - Дата - Период движения
//  Статус				 - ПеречислениеСсылка.СтатусыПоручений - Устанавливаемый статус
//  КоличествоИсполнения - Число - Исполненное количество ЦБ (необязательный)
//
Процедура УстановитьСтатус(Движения, Поручение, Дата, Статус, КоличествоИсполнения = 0) Экспорт
	Перем Движение;
	
	Если Поручение.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения.СтатусыПоручений.Добавить();
	Движение.Период				= Дата;
	Движение.Поручение			= Поручение;
	Движение.СтатусПоручения	= Статус;
	Движение.КоличествоИсполнения = КоличествоИсполнения;
	
	Движения.СтатусыПоручений.Записать();
КонецПроцедуры

// Возвращает самый последний установленный статус для переданного поручения.
//
// Параметры:
//  Поручение	 - ДокументСсылка.Поручение	 - Поручение, для которого возвращается статус
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.СтатусыПоручений
//
Функция СтатусПоручения(Поручение) Экспорт
	Перем Отбор;
	
	Отбор = Новый Структура("Поручение", Поручение);
	Возврат РегистрыСведений.СтатусыПоручений.ПолучитьПоследнее(, Отбор).СтатусПоручения;
КонецФункции
